spsarolkar/stm8s-i2c-slave/src/main.c
/**
  ******************************************************************************
  * @file    I2C/I2C_TwoBoards/I2C_DataExchange/Slave/main.c
  * @author  MCD Application Team
  * @version V2.0.4
  * @date    26-April-2018
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
// #include "stm8s_eval.h"
#include "main.h"
#include "stdio.h"

/** @addtogroup I2C_TwoBoards
  * @{
  */

/** @addtogroup I2C_DataExchange
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#ifdef _RAISONANCE_
#define PUTCHAR_PROTOTYPE int putchar (char c)
#define GETCHAR_PROTOTYPE int getchar (void)
#elif defined (_COSMIC_)
#define PUTCHAR_PROTOTYPE char putchar (char c)
#define GETCHAR_PROTOTYPE char getchar (void)
#else /* _IAR_ */
#define PUTCHAR_PROTOTYPE int putchar (int c)
#define GETCHAR_PROTOTYPE int getchar (void)
#endif /* _RAISONANCE_ */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
  * @brief Retargets the C library printf function to the UART.
  * @param c Character to send
  * @retval char Character sent
  */
PUTCHAR_PROTOTYPE
{
  /* Write a character to the UART1 */
  UART1_SendData8(c);
  /* Loop until the end of transmission */
  while (UART1_GetFlagStatus(UART1_FLAG_TXE) == RESET);

  return (c);
}

/**
  * @brief Retargets the C library scanf function to the USART.
  * @param None
  * @retval char Character to Read
  */
GETCHAR_PROTOTYPE
{
#ifdef _COSMIC_
  char c = 0;
#else
  int c = 0;
#endif
  /* Loop until the Read data register flag is SET */
  while (UART1_GetFlagStatus(UART1_FLAG_RXNE) == RESET);
    c = UART1_ReceiveData8();
  return (c);
}

static inline void delay_ms(uint16_t ms) {
    uint32_t i;
    for (i = 0; i < ((F_CPU / 18000UL) * ms); i++)
        __asm__("nop");
}
/* Public functions ----------------------------------------------------------*/

// void i2c_init() {

// 	  /* Disable I2C to configure TRISER */
//   I2C->CR1 &= (uint8_t)(~I2C_CR1_PE);

//   /* Clear CCRH & CCRL */
// //   I2C->CCRH &= (uint8_t)(~(I2C_CCRH_FS | I2C_CCRH_DUTY | I2C_CCRH_CCR));
// //   I2C->CCRL &= (uint8_t)(~I2C_CCRL_CCR);
  
// 	I2C->FREQR &= (uint8_t)(~I2C_FREQR_FREQ);
// 	printf("\nI2C_FREQR %d",1 << 1);
//     I2C->FREQR = (1 << 1);
//     I2C->CCRL = 0x0A; // 100kHz
// 	I2C->TRISER=0x03; // I2C_FREQR=2Mhz, 1/2Mhz= 500ns , standard mode scl rise time = 1000ns. 1000ns/500ns=2, 2+1=3
// 	printf("\nI2C_OARH %d\n",(1<<I2C_OARH_ADDMODE));
//     I2C->OARH = (1 << 6); // 7-bit addressing
// 	I2C->OARL = (1 << SLAVE_ADDRESS); //slave address
//     I2C->CR1 = (1 << I2C_CR1_PE);
// }

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
void main(void)
{

  /* system_clock / 1 */
  CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
  
//   /* Initialize LEDs mounted on STM8/128-EVAL board */
//   STM_EVAL_LEDInit(LED2);
// 		STM_EVAL_LEDOff(LED2);
	UART1_DeInit();
  /* UART1 configuration ------------------------------------------------------*/
  /* UART1 configured as follow:
        - BaudRate = 115200 baud  
        - Word Length = 8 Bits
        - One Stop Bit
        - No parity
        - Receive and transmit enabled
        - UART1 Clock disabled
  */
  UART1_Init((uint32_t)115200, UART1_WORDLENGTH_8D, UART1_STOPBITS_1, UART1_PARITY_NO,
              UART1_SYNCMODE_CLOCK_DISABLE, UART1_MODE_TXRX_ENABLE);

  printf("I2C_DeInit \n");
  I2C_DeInit();
  /* Initialize I2C peripheral */
  /* Disable I2C to configure TRISER */
  //I2C->CR1 &= (uint8_t)(~I2C_CR1_PE);

//i2c_init();
#ifdef I2C_slave_7Bits_Address
  I2C_Init(100000, SLAVE_ADDRESS, I2C_DUTYCYCLE_2, I2C_ACK_CURR, I2C_ADDMODE_7BIT, 2);           
#else
  I2C_Init(100000, SLAVE_ADDRESS, I2C_DUTYCYCLE_2, I2C_ACK_CURR,I2C_ADDMODE_10BIT, 16);
#endif
printf("I2C->CR1 %d\n",I2C->CR1);
printf("I2C_ITConfig \n");
  /* Enable Error Interrupt*/
 // I2C_ITConfig((I2C_IT_TypeDef)(I2C_IT_ERR | I2C_IT_EVT | I2C_IT_BUF), ENABLE);
 // I2C_ITConfig((I2C_IT_TypeDef)(I2C_IT_ERR | I2C_IT_BUF), ENABLE);
//printf("enableInterrupts \n");
  /* Enable general interrupts */
 // enableInterrupts();

  /*Main Loop */
  while (1)
  {
    /* infinite loop */
	printf("\n%d",I2C->SR1);

	if(I2C->SR1 & I2C_SR1_ADDR)
	{
		printf("Address matched\n");
		//(void)I2C->SR1;
		(void)I2C->SR3;
delay_ms(500);
		printf("I2C->DR %d\n",I2C->DR);
		printf("I2C->SR3 %d\n",I2C->SR3);
	}

	delay_ms(2000);
  }
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {}
}
#endif

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
